# IntegerParameterValue Constructor (Int32)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IntegerParameterValue Constructor (Int32)
IntegerParameterValue Class See Also
---
Value constructor
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016 Subscription Update
# Syntax
C#
---
```text
public IntegerParameterValue(
	int value
)
```

Visual Basic
---
```text
Public Sub New ( _
	value As Integer _
)
```

Visual C++
---
```text
public:
IntegerParameterValue(
	int value
)
```

# ### Parameters
value
    Type: System..::..Int32
# See Also
IntegerParameterValue Class
IntegerParameterValue Overload
Autodesk.Revit.DB Namespace